Repository: mozilla-l10n/mt-training-data
Catalog: mcx/mcx_pontoon.tmx
Source language: en_us
Languages: mcx

source: success checkmark
mcx: akyɛvɛ

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
mcx: jɛndalaga kendɔ agwomɔ kolɔ mɛgɔlɔ njē mɛnkyɔla. Jɛndalaga kendɔ amyali kolɔ pili. Jɛndalaga kendɔ ako kolɔ peŋɔlɔ. <strong>Bii ja akɛndi mogaa bi benjagɔ!</strong>

source: Taking several attempts to read a word.
mcx: asa buwaa bivyegɔ kolɔ laŋ mɛnkyɔla.

source: Tap
mcx: nyamɔga ri

source: Technology and Robotics
mcx: bisagɔ kam ɓorom mɛsala nɛ bisagɔ kwali penja ɓorom

source: Thank you for contributing your bulk submission!
mcx: bubuli ɛhɛŋ nɛ mɛsala antee bwaa binjē mɛnkyɔla!

source: Thank you for contributing your voice!
mcx: bubuli ɛhɛŋ nɛ ayɛ gwondɔ yen!

source: Thank you for donating your voice clips!
mcx: bubuli ɛhɛŋ nɛ gondɔ yen bi yɛgɔ!

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
mcx: bubuli ɛhɛŋ riyashu mɛɓagɔlɔ men !<lineBreak></lineBreak> sisiŋ bi nɛ jala nyamɔ nɛ kɛndi mɛnkyɔla di ɓɛsi.

source: Thank you for your voice information
mcx: bubuli ɛhɛŋ nɛ bilaŋ gwondɔ yen

source: The bumblebee sped by.
mcx: alɔlɔŋ mɔ kɔga

source: The clip has disrespectful or offensive language.
mcx: i nɛ janji jee mɛlwee to mpɛgi mɛkali

source: The giant dinosaur of the Triassic.
mcx: ɓɔga shogɔ ɗɔli

source: The giant dinosaurs of the Triassi-.
mcx: ɓɔga bishogɔ ɗɔli

source: The giant dinosaurs of the Triassic.
mcx: ɓɔga bishogɔ ɗɔli

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
mcx: ɓɔga bishogɔ ɗɔli. <strong>[i laŋ nɛ asɔgi gwondɔ]</strong>

source: The giant dinosaurs of the Triassic. Yes.
mcx: ɓɔga bishogɔ ɗɔli. Eyɔ

source: The giant dino <strong>[cough]</strong> the Triassic.
mcx: ɓɔga bishogɔ <strong>[ kɔyɛ]</strong> ɗɔli.

source: There are currently no sentences to review in this language.
mcx: ya ɓɛ nɛ nu njē mɛnkyɔla aɓɛɛ ndi sisiŋ to atavɔ yi

source: The recording was too long.
mcx: aɓagɔlɔ i ɗɔŋaa

source: The recording was too quiet.
mcx: gwondɔ aɓagɔlɔ i nkɔŋ

source: The recording was too short.
mcx: aɓagɔlɔ i mɔmɔnaa

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
mcx: i nɛ bipenja gwondɔ i jɔ ɗaa ri pɔgi ɓorɔ laŋ gɔ. Piliga njenɛ ti ɓɛnɛ gwondɔ yɔ ɗoraa tɛla jinɛ aɓagɔlɔ i sɛgalaa, je (sa ɓɛ siŋa) ti i ɓɛ sɛya ndugu tɛla jinɛ bi a jala gwogɔ sagɔ ɓɛ ke to mɛnkyɔla.

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
mcx: mori atɔgi binjē mɛnkyɔla mɔ kɛ kendɔ njɔɔ mɛsala Common Voice. bi nɛ jala <writeURL>nkyɔli</writeURL> njē mɛnkyɔla wɔrɔ jee <reviewURL>aɓɛ ndi</reviewURL> binjē mɛnkyɔla ɓɔya Common Voice.

source: The sentence has a grammatical or spelling error.
mcx: i nɛ ɓeya atuvɔ jee akyɔli to njē mɛnkyɔla

source: The sentence has disrespectful or offensive language.
mcx: i nɛ mɛkali janji jee mɛlwe to njē mɛnkyɔla.

source: The sentence must be grammatically correct.
mcx: njē mɛnkyɔla i goŋini nyuwaya

source: The sentence must be speakable.
mcx: njē mɛnkyɔla i jala tuwaa

source: The sentence must be spelled correctly.
mcx: njē mɛnkyɔla i ɓɛ nkyɔlaa nyuwaya

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
mcx: ɓaa fala bilaŋ bi; bi nɛ jala kala yɛ ti bi kwali. Mɔɔ hɛ kwaŋgɔlɔ ŋgwɔŋ bilaŋ, hɛ yɛ kali jijinɔ e hɛ sa nɛ bilaŋ ti jinɔ yen nɛ jinɔ kuli pɛnɔ yen iɓɛ jaaŋ ti bilaŋ mbyala saa mbu mimyɔŋ.

source: Three to go!
mcx: bikɛn lali !

source: Too many files
mcx: bwaa bisagɔ

source: Transcribe audio recordings into text
mcx: sa ga akyɔli mɛɓagɔlɔ alɔlɔŋ ri mɛkyɔli

source: Transcribe audio recordings in your language
mcx: akyɔli mɛɓagɔlɔ alɔlɔŋ to atavɔ yen

source: Try again by dragging your file here
mcx: ɓagɔlɔga nɛ ajendala sagɔ yen wa

source: Try uploading again
mcx: wegɔra nji akɛndiya

source: Understand contribution criteria
mcx: agwogɔ bisan i kam a sa san

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
mcx: gwogɔga sagɔ di nɛ bi komɔ ri bimpɛgi gwondɔ e kalaga bitwee ri bisagɔ bi ɓagɔlɔrɔ!

source: Upload aborted. Do you want to delete your recordings?
mcx: aku akɛndi. Bi ri kwali tindi mɛɓagɔlɔ men?

source: { $uploadedSentences } of { $totalSentences } sentences collected
mcx: binjē mɛnkyɔla i tɔga ri{ $uploadedSentences } { $totalSentences }

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
mcx: kpogiga <downloadLink>here</downloadLink> kolɔ bulɔlɔ binjē mɛnkyɔla i pilaa gɔ

source: Upload failed, please retry.
mcx: aku akɛndi, wegɔga ndi

source: Upload <icon></icon> public domain sentences
mcx: kɛnjiga<icon></icon> binjē mɛnkyɔla sɛŋ

source: Upload in progress...
mcx: akɛndiya

source: Upload more sentences?
mcx: akɛndi biswii binjē mɛnkyɔla?

source: Use correct grammar
mcx: mɛlayɛ i ɓɛ́ nyuwaa

source: Use correct spelling and punctuation
mcx: akyɔli nɛ biswee i ɓɛ nyuwaa

source: Validate Readings
mcx: amɛgɔlɔ alaŋ

source: Validate Readings, Review Transcriptions
mcx: amɛgɔlɔ alaŋ, aɓɛɛ akyɔli

source: Validate Readings <small>(Coming soon)</small>
mcx: amɛgɔlɔ alaŋ <small>(mbogi mpusɔ)</small>

source: Validate readings submitted by community members
mcx: amɛgɔlɔ alaŋ ɓorɔ ɗali ɓɛ kɛndi gɔ

source: Validate user-recorded readings in your language
mcx: amɛgɔlɔ alaŋ i ɓagɔlɔ a gɔ nɛ ɓorɔ ɗali to atavɔ yen

source: Varying Pronunciations
mcx: mɛtuva ntindi

source: Volume
mcx: gwondɔ

source: Want to save your information? <createProfile>Create a profile</createProfile>
mcx: bi ri kwali ɓagɔlɔ bilaŋ wen ? <createProfile>akwagɔ jinɔ</createProfile>

source: We are going out to get a coffee.
mcx: ŋgula ɗowɔ i na jen nyuwaa

source: We are going out to get coffee.
mcx: ŋgula ɗowɔ na jen nyuwaa

source: We couldn’t get any audio clips for you to listen to. Please try again later.
mcx: haa bela bitwee gwondɔ nɛ hɛ gwogɔ. wegɔga muu

source: We couldn’t get any sentences for you to speak. Please try again later.
mcx: haa bela binjē mɛnkyɔla kolɔ tuvɔ. Wegɔga muu

source: We may have run out of clips - refresh the page, or try again later.
mcx: ha ɓɛge nɛ bitwee kolɔ nɔ to ajeŋ yi

source: We’re going out to get coffee.
mcx: ŋgula ɗowɔ na jen nyuwaa

source: We're making some big changes
mcx: hɛ ri sa vaŋ bipenja

source: We’re sorry, your platform is not currently supported.
mcx: juga ɓeyɔ, njɔɔ mɛsala men yaa le nɔya.

source: We've run out of sentences to record in this language...
mcx: haa ɓɛ ge nɛ binjē mɛnkyɔla kolɔ ɓagɔlɔ to atavɔ yi...

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
mcx: i nyuwaa nɛ mɛlaŋgɔlɔ ajegi i nɔ buwa mɛwagɔ kɔŋ. lelaa biduŋ i nɛ jala mɛgala ti ɓɛnɛ ya pɔgi ɓe agwogɔ binjē mɛnkyɔla yɛya. jembi ɓɛ sa ɓɛ̄ kɔŋ tɛtɛgi i ndi mɛgalaa, ɓaa mɛgɔlɔ lelaa jembi i kambɔlɔ ɓe nɛ bi gwogɔ mɛnkyɔla

source: What issues are you experiencing with this sentence?
mcx: bi nɛ ya biluvi nɛ njē mɛnkyɔla yi?

source: What needs to be in my file?
mcx: sagɔ yam jala nɔ ye?

source: What sentences can I add?
mcx: mɛ nɛ jala kala yaa mɛnkyɔla ré?

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
mcx: ntimɔ agwogɔ, ɓɛga nyuwaa nɛ bi sagɔ bi ɓagɔlɔgɔ i kɛɛ nɛ mɛnkyɔla; piliga ti ɓɛnɛ i nɛ ɓɔɓɔnɔ mɛku. <br/>ɓɛɛ mɛku i di nkwaŋ gɔ:

source: Why are you asking?
mcx: ndiya yi i ri aswe?

source: With a profile, you can keep track of your activity and connect with a community of voice data contributors.
mcx: nɛ nu jinɔ, bi nɛ jala duyɔ mɛsala men nɛ ajaŋ ɓee nɛ nu ɗali kaa bilaŋ gwondɔ.

source: Write
mcx: akyɔli

source: Write options menu
mcx: ɓandi asayɛ «akyɔli»

source: y
mcx: o

source: Y
mcx: O

source: Yes
mcx: eyɔ

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
mcx: bi nɛ jala nɔ ɓɔɓɔnɔ nkye sagɔ nkayɛ nkyɔla: { sc-review-form-button-approve-shortcut } kolɔ mɛgɔlɔ, { sc-review-form-button-reject-shortcut } kolɔ pili, { sc-review-form-button-skip-shortcut } kolɔ lena

source: You cannot add multiple sentences for a single submission
mcx: bi aa jala kala buwa binje mɛnkyɔla ri akɛndi wɔrɔ

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
mcx: bi aa sayɛ gan atavɔ. kɛndɔra ri ɓandi <profileLink>jinɔ yen</profileLink> kolɔ sayɛ mɛtavɔ

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
mcx: { $retryLimit } bintimɔ nɛ bi kɛndi nu mindi njē mɛnkyɔla. bubuli ɛhɛŋ nɛ aɓondɔ !

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
mcx: { $retryLimit } ɓɔɓɔnɔ bintimɔ nɛ bi kɛndi nu mindi njē mɛnkyɔla. bubuli ɛhɛŋ nɛ aɓondɔ !

source: You must allow microphone access.
mcx: mɛgɔlɔga abi mɔmɔnɔ kuli atavɔ

source: You’re contributing to a target segment
mcx: bi sala ri nu mɛsala

source: You’re contributing to our first target segment
mcx: bi sala ri ashɔgi mɛsala mo

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
mcx: bi kɛ kunaa. Nɔga mɔmɔnɔ kolɔ ɓalɔ laŋ ndi njē mɛnkyɔla nɛ aɓɛɛ jiɓɛ nɛ i nyuwaa.

source: You're helping Common Voice reach our daily sentence goals!
mcx: akamɓee saa gondɔ yam kolɔ kumɔ mɛsala binjē mɛnkyɔla jaa nɛ mɛlu

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
mcx: ajeŋ yen yaɓɛge nɛ bitwee! Ti ɓɛnɛ bi tambɔ, bi nɛ jala penja bi kɛn wen kolɔ legɔlɔ bi nu njē mɛnkyɔla to atavɔ yen.

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
mcx: i jɔ nɛ ajeŋ yen yaɓɛge nɛ binjē mɛnkyɔla ! Ti ɓɛnɛ bi tambɔ, bi nɛ jala penja bi kɛn wen kolɔ legɔlɔ nu binjē mɛnkyɔla to atavɔ yen.

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
mcx: ri ashu yen, Common Voice mɔɔ kumɔ <goalPercentage></goalPercentage> mɛsala mɛ nyɛ sa janalu { $goalValue } mɛɓagɔlɔ!

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
mcx: ri ashu yen, Common Voice mɔɔ kumɔ <goalPercentage></goalPercentage> mɛsala mɛ nyɛ sa janalu { $goalValue } mɛmɛgɔlɔ!
